       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. swap.
AUTHOR.     Sean Poston.
DATA DIVISION.
LINKAGE SECTION.
       01 LIST.
           02 ARRAYINDEX PIC 9(3) OCCURS 10 TIMES.
       01 SWAPVARS.
           02 TEMP         PIC 9(2).
           02 INDEXA       PIC 9(2).
           02 INDEXB       PIC 9(2).
PROCEDURE DIVISION USING LIST, SWAPVARS.
      *> INDEXA and INDEXB are indices that are to be swapped.
       MOVE ARRAYINDEX(INDEXA) TO TEMP.
       MOVE ARRAYINDEX(INDEXB) TO ARRAYINDEX(INDEXA).
       MOVE TEMP TO ARRAYINDEX(INDEXB).
EXIT PROGRAM.
