       IDENTIFICATION DIVISION.
       PROGRAM-ID. addition.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  MAT1.
              02  MR1  OCCURS 5 TIMES.
                     03  MC1  PIC 9(2)  OCCURS 5 TIMES.
       01  MAT2.
              02  MR2  OCCURS 5 TIMES.
                     03  MC2  PIC 9(2)  OCCURS 5 TIMES.
       01  MAT3.
              02  MR3  OCCURS 5 TIMES.
                     03  MC3  PIC 9(3)  OCCURS 5 TIMES.
       77  ROW1  PIC  9.
       77  ROW2  PIC  9.
       77  COL1  PIC  9.
       77  COL2  PIC  9.
       77  I  PIC  9.
       77  J  PIC  9.
       77  K  PIC  9.
       PROCEDURE DIVISION.
       MAIN-PARA.
       DISPLAY "ENTER THE NUMBER OF ROWS AND COLUMNS OF I MATRIX".
       ACCEPT ROW1.
       ACCEPT COL1.
       DISPLAY "ENTER THE NUMBER OF ROWS AND COLUMNS OF II MATRIX".
       ACCEPT ROW2.
       ACCEPT COL2.
       IF (ROW1 NOT >= ROW2)
           DISPLAY "MATRIX MULTIPLICATION IS NOT POSSIBLE"
               STOP RUN
       ELSE 
           PERFORM MULT-PARA.

       FILL1-PARA.
           ACCEPT MC1(I J).

       FILL2-PARA.
           ACCEPT MC2(I J).

       MULT-PARA.
       ADD ROW1 ROW2 GIVING I.
       ADD COL1 COL2 GIVING J.

       DISPLAY "ENTER THE ELEMENTS OF MATRIX 1"
       PERFORM FILL1-PARA VARYING I FROM 1 BY 1 UNTIL I>ROW1
           AFTER J FROM 1 BY 1 UNTIL J>COL1.
       DISPLAY "ENTER THE ELEMENTS OF MATRIX 2"
       PERFORM FILL2-PARA VARYING I FROM 1 BY 1 UNTIL I>ROW2
           AFTER J FROM 1 BY 1 UNTIL J>COL2.

       PERFORM INIST-PARA VARYING I FROM 1 BY 1 UNTIL I>ROW1
           AFTER J FROM 1 BY 1 UNTIL J>COL2.
       PERFORM MULTMAT-PARA VARYING I FROM 1 BY 1 UNTIL I>ROW1
           AFTER J FROM 1 BY 1 UNTIL J>COL2
           AFTER K FROM 1 BY 1 UNTIL K>COL1
       DISPLAY "THE RESULTING MATRIX IS".
       PERFORM DISP-PARA VARYING I FROM 1 BY 1 UNTIL I>ROW1
           AFTER J FROM 1 BY 1 UNTIL J>COL2.
       STOP RUN.

       MULTMAT-PARA.
           COMPUTE MC3(I J) = MC3(I J)+MC1(I K)*MC2(K J).
       INIST-PARA.
           COMPUTE MC3(I J) = 0.
       DISP-PARA.
           DISPLAY MC3(I J).